arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/inc/fsl_power_manager.h
/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Power manager initialization for operation.
 *
 * This function initializes the Power manager and its run-time state structure.
 * Reference to an array of Power mode configuration structures has to be passed
 * as a parameter along with a parameter specifying its size. At least one power mode
 * configuration is required. Optionally, reference to the array of predefined
 * callbacks can be passed with its size parameter.
 * For details about callbacks, refer to the power_manager_callback_user_config_t.
 * As Power manager stores only references to array of these structures, they have
 * to exist while Power manager is used.
 * It is expected that prior to the POWER_SYS_Init() call the write-once protection
 * register was configured appropriately allowing for entry to all required low power
 * modes.
 * The following is an example of how to set up two power modes and one
 * callback, and initialize the Power manager with structures containing their settings.
 * The example shows two possible ways the configuration structures can be stored
 * (ROM or RAM), although it is expected that they will be placed in the read-only
 * memory to save the RAM space. (Note: In the example it is assumed that the programmed chip
 * doesn't support any optional power options described in the power_manager_user_config_t)
 * :
 * @code
 
  power_manager_user_config_t vlprConfig = {   vlprConfig power mode configuration 
      .powerMode = POWER_MANAGER_VLPR,
      .sleepOnExitOption = false,
      .sleepOnExitValue = false,
  };       

  power_manager_user_config_t stopConfig = {   stopConfig power mode configuration 
      .powerMode = POWER_MANAGER_STOP,
      .sleepOnExitOption = false,
      .sleepOnExitValue = false,
  };        

  power_manager_user_config_t const * powerConfigsArr[] = {    Power mode configurations array
      &vlprConfig,
      &stopConfig
  };

  power_manager_callback_user_config_t callbackCfg0 = {  Callback configuration structure callbackCfg0
      .callbackFunction                     = &callback0,
      .callbackType                         = POWER_MANAGER_CALLBACK_BEFORE_AFTER,
      .callbackData                         = (void *)0,
  };     

  power_manager_callback_user_config_t const * callbacksConfigsArr[] = {  Callback configuration structures array
      &callbackCfg0
  };
 
  power_manager_error_code_t callback0(power_manager_notify_struct_t * notify,   Definition of power manager callback
                                       power_manager_callback_data_t * dataPtr)
  {
    power_manager_error_code_t ret = POWER_MAN_SUCCESS;
    ...    
    return ret;
  }

  int main(void) Main function 
  {    
    power_manager_error_code_t ret = POWER_MAN_SUCCESS;

    Calling of init method
    POWER_SYS_Init(&powerConfigsArr, 2U, &powerStaticCallbacksConfigsArr, 1U);  
    
    Switch to VLPR mode
    ret = POWER_SYS_SetMode(MODE_VLPR,POWER_MANAGER_POLICY_AGREEMENT);
    
    if (ret != POWER_MAN_SUCCESS) 
    {
      return -1;
    }
    return 0;
  }
  
 * @endcode
 *
 * @param[in] powerConfigsPtr A pointer to an array with references to all power
 *  configurations which will be handled by Power manager.
 * @param[in] configsNumber Number of power configurations. Size of powerConfigsPtr
 *  array.
 * @param[in] callbacksPtr A pointer to an array with references to callback configurations.
 *  If there are no callbacks to register during Power manager initialization, use NULL value.
 * @param[in] callbacksNumber Number of registered callbacks. Size of callbacksPtr
 *  array.
 * @return An error code or POWER_MANAGER_SUCCESS.
 */
power_manager_error_code_t POWER_SYS_Init(power_manager_user_config_t const * (* powerConfigsPtr)[],
                                          uint8_t configsNumber,
                                          power_manager_callback_user_config_t const * (* callbacksPtr)[],
                                          uint8_t callbacksNumber);

/*!
 * @brief This function deinitializes the Power manager.
 *
 * @return An error code or POWER_MANAGER_SUCCESS.
 */
power_manager_error_code_t POWER_SYS_Deinit(void);

/*!
 * @brief This function configures the power mode.
 *
 * This function switches to one of the defined power modes. Requested mode number is passed
 * as an input parameter. This function notifies all registered callback functions before
 * the mode change (using  POWER_MANAGER_CALLBACK_BEFORE set as callback type parameter),
 * sets specific power options defined in the power mode configuration and enters the specified
 * mode. In case of run modes (for example, Run, Very low power run, or High speed run), this function
 * also invokes all registered callbacks after the mode change (using POWER_MANAGER_CALLBACK_AFTER).
 * In case of sleep or deep sleep modes, if the requested mode is not exited through
 * a reset, these notifications are sent after the core wakes up.
 * Callbacks are invoked in the following order: All registered callbacks are notified
 * ordered by index in the callbacks array (see callbacksPtr parameter of POWER_SYS_Init()).
 * The same order is used for before and after switch notifications.
 * The notifications before the power mode switch can be used to obtain confirmation about
 * the change from registered callbacks. If any registered callback denies the power
 * mode change, further execution of this function depends on mode change policy: the mode
 * change is either forced (POWER_MANAGER_POLICY_FORCIBLE) or exited (POWER_MANAGER_POLICY_AGREEMENT).
 * When mode change is forced, the result of the before switch notifications are ignored. If
 * agreement is required, if any callback returns an error code then further notifications
 * before switch notifications are cancelled and all already notified callbacks are re-invoked
 * with POWER_MANAGER_CALLBACK_AFTER set as callback type parameter. The index of the callback
 * which returned error code during pre-switch notifications is stored (any error codes during
 * callbacks re-invocation are ignored) and POWER_SYS_GetErrorCallback() can be used to get it.
 * Regardless of the policies, if any callback returned an error code, an error code denoting in which phase
 * the error occurred is returned when POWER_SYS_SetMode() exits.
 * It is possible to enter any mode supported by the processor. Refer to the chip reference manual
 * for list of available power modes. If it is necessary to switch into intermediate power mode prior to
 * entering requested mode (for example, when switching from Run into Very low power wait through Very low
 * power run mode), then the intermediate mode is entered without invoking the callback mechanism.
 *
 * @param[in] powerModeIndex Requested power mode represented as an index into
 *  array of user-defined power mode configurations passed to the POWER_SYS_Init().
 * @param[in] policy Transaction policy
 * @return An error code or POWER_MANAGER_SUCCESS.
 */
power_manager_error_code_t POWER_SYS_SetMode(uint8_t powerModeIndex, power_manager_policy_t policy);

/*!
 * @brief This function returns power mode set as the last one.
 *
 * This function returns index of power mode which was set using POWER_SYS_SetMode() as the last one.
 * If the power mode was entered even though some of the registered callback denied the mode change,
 * or if any of the callbacks invoked after the entering/restoring run mode failed, then the return
 * code of this function has POWER_MANAGER_ERROR value.
 *
 * @param[out] powerModeIndexPtr Power mode which has been set represented as an index into array of power mode
 * configurations passed to the POWER_SYS_Init().
 * @return An error code or POWER_MANAGER_SUCCESS.
 */
power_manager_error_code_t POWER_SYS_GetLastMode(uint8_t* const powerModeIndexPtr);

/*!
 * @brief This function returns user configuration structure of power mode set as the last one.
 *
 * This function returns reference to configuration structure which was set using POWER_SYS_SetMode()
 * as the last one. If the current power mode was entered even though some of the registered callback denied
 * the mode change, or if any of the callbacks invoked after the entering/restoring run mode failed, then
 * the return code of this function has POWER_MANAGER_ERROR value.
 *
 * @param[out] powerModePtr Pointer to power mode configuration structure of power mode set as last one.
 * @return An error code or POWER_MANAGER_SUCCESS.
 */
power_manager_error_code_t POWER_SYS_GetLastModeConfig(power_manager_user_config_t** const powerModePtr);

/*!
 * @brief This function returns currently running power mode.
 *
 * This function reads hardware settings and returns currently running power mode. Generally,
 * this function can return only POWER_MANAGER_RUN, POWER_MANAGER_VLPR or POWER_MANAGER_HSRUN value.
 *
  * @return Currently used run power mode.
 */
power_manager_modes_t POWER_SYS_GetCurrentMode(void);

/*!
 * @brief This function returns the last failed notification callback.
 *
 * This function returns index of the last callback that failed during the power mode switch while
 * the last POWER_SYS_SetMode() was called. If the last POWER_SYS_SetMode() call ended successfully 
 * value equal to callbacks number is returned. Returned value represents index in the array of 
 * static call-backs.
 *
 * @return Callback index of last failed callback or value equal to callbacks count.
 */
uint8_t POWER_SYS_GetErrorCallbackIndex(void);

/*!
 * @brief This function returns the last failed notification callback configuration structure.
 *
 * This function returns pointer to configuration structure of the last callback that failed during 
 * the power mode switch while the last POWER_SYS_SetMode() was called. 
 * If the last POWER_SYS_SetMode() call ended successfully value NULL is returned. 
 *
 * @return Pointer to the callback configuration which returns error.
 */
power_manager_callback_user_config_t* POWER_SYS_GetErrorCallback(void);

#if defined(__cplusplus)
}
#endif

/*! @}*/

#endif /* __FSL_POWER_MANAGER_H__ */
/*******************************************************************************
 * EOF
 ******************************************************************************/

